In [42]:
import pandas as pd
import numpy as np

1. Import the customer data into python.

In [43]:
customer = pd.read_csv('C:/Users/hp/Desktop/IM ML OJT/Week 1/Task 2/Customers.csv',encoding='latin1')

2. Understand the data using different functions and attributes like shape, index, columns, dtypes.ndim, info(), get_dtype_counts etc.

In [44]:
customer.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0

In [45]:
customer.shape

(10000, 14)

In [55]:
customer.shape[0]

10000

In [56]:
customer.shape[1]

14

In [57]:
customer.index

RangeIndex(start=0, stop=10000, step=1)

In [58]:
customer.columns

Index(['Customer_ID', 'Gender', 'First_Date', 'First_region', 'First_state',
       'First_city', 'Recent_Date', 'Last_region', 'Last_state', 'Last_city',
       'Customer_Value', 'Buy_Times', 'Points_Earned', 'Points_Redeemed'],
      dtype='object')

In [59]:
customer.dtypes

Customer_ID          int64
Gender              object
First_Date           int64
First_region        object
First_state         object
First_city          object
Recent_Date          int64
Last_region         object
Last_state          object
Last_city           object
Customer_Value     float64
Buy_Times            int64
Points_Earned      float64
Points_Redeemed    float64
dtype: object

In [60]:
customer.ndim

2

In [61]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Customer_ID      10000 non-null  int64
 1   Gender           9986 non-null   object
 2   First_Date       10000 non-null  int64
 3   First_region     9979 non-null   object
 4   First_state      9983 non-null   object
 5   First_city       10000 non-null  object
 6   Recent_Date      10000 non-null  int64
 7   Last_region      10000 non-null  object
 8   Last_state       10000 non-null  object
 9   Last_city        10000 non-null  object
 10  Customer_Value   9964 non-null   float64
 11  Buy_Times        10000 non-null  int64
 12  Points_Earned    9979 non-null   float64
 13  Points_Redeemed  9988 non-null   float64
dtypes: float64(3), int64(4), object(7)
memory usage: 1.1+ MB

In [62]:
customer.dtypes.value_counts()

object     7
int64      4
float64    3
dtype: int64

In [63]:
customer.count()

Customer_ID        10000
Gender              9986
First_Date         10000
First_region        9979
First_state         9983
First_city         10000
Recent_Date        10000
Last_region        10000
Last_state         10000
Last_city          10000
Customer_Value      9964
Buy_Times          10000
Points_Earned       9979
Points_Redeemed     9988
dtype: int64

3. What is percentage of missing values for customer Value variable?

In [64]:
customer['Customer_Value'].isnull().sum()

36

In [65]:
customer.shape[0]

10000

In [66]:
customer['Customer_Value'].isnull().sum()/customer.shape[0]

0.0036

In [67]:
round(((customer['Customer_Value'].isnull().sum()/customer.shape[0])*100),3)

0.36

4. Create two subsets with unique and duplicate values.

In [68]:
customer['Customer_ID'].duplicated().sum()

45

In [69]:
duplicate= customer[customer['Customer_ID'].duplicated()]
duplicate.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
9817,113918804,M,20120226,West,Gujarat,Ahmedabad,20120712,West,Gujarat,Ahmedabad,7048.800,6,282.0,0.0
9818,113933467,F,20120226,South,Tamil Nadu,Chennai,20130312,East,Bihar,Patna,68863.601,19,3374.0,0.0
9819,41337621,F,20120228,West,Gujarat,Surat,20130207,West,Gujarat,Surat,7036.001,6,635.0,0.0
9820,6896372,M,20120228,West,Maharashtra,Nashik,20120228,West,Maharashtra,Nashik,1259.000,1,70.0,0.0
9821,114142599,M,20120303,West,Gujarat,Surat,20130205,West,Gujarat,Surat,19136.096,13,986.0,0.0

In [70]:
duplicate.shape

(45, 14)

In [71]:
unique= customer[customer['Customer_ID'].duplicated()==False]
unique.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0

In [72]:
unique.shape

(9955, 14)

5. Create data set with list of customers whose customer value greater than 10000.

In [73]:
customer10K= customer[customer['Customer_Value']> 10000]
customer10K.shape[0]

2723

In [74]:
customer10K= customer[customer['Customer_Value']> 10000].reset_index(drop= True)

In [75]:
customer10K.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
0,1610085,F,20120103,North,Delhi,Delhi,20121013,North,Delhi,Delhi,10380.199,6,1189.0,0.0
1,7518872,M,20120104,North,Uttar Pradesh,Kanpur,20130123,North,Uttar Pradesh,Kanpur,14587.000,6,865.0,0.0
2,63508964,M,20120106,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,145472.702,36,680.0,16635.0
3,23667984,F,20120107,West,Maharashtra,Nagpur,20130313,West,Maharashtra,Nagpur,19640.700,12,268.0,2549.0
4,84634600,M,20120108,South,Karnataka,Bangalore,20130307,South,Karnataka,Bangalore,32377.602,22,1029.0,1771.0

6. In customer table, create a new variable called “customer value segment” using customer value as follows. -
- High Value Segment - > 25000
- Medium Value Segment – Between 10000 and 25000
- Low Value Segment – less than or equal to 10000

In [78]:
from numpy import where as IF
cust_val= customer['Customer_Value']
customer['Customer_value_segment']= IF(cust_val > 25000, 'High Segment', IF((cust_val > 10000) & (cust_val < 25000), 'Medium Segment','Low Segment'))

In [79]:
customer.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed,Customer_value_segment
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0,Low Segment
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0,Low Segment
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0,Low Segment
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0,Low Segment
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0,Low Segment

7. Create variables “average revenue per trip” and “balance points” in the customer data set.

In [80]:
customer = customer.assign(average_revenue_per_trip= customer['Customer_Value']/customer['Buy_Times'], Balance_Points=customer['Points_Earned'] - customer['Points_Redeemed'] )

In [81]:
customer.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed,Customer_value_segment,average_revenue_per_trip,Balance_Points
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0,Low Segment,1016.0,200.0
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0,Low Segment,1709.0,100.0
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0,Low Segment,523.0,10.0
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0,Low Segment,5132.0,170.0
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0,Low Segment,1008.0,60.0

8. How many days between last purchase date and today?

In [82]:
import datetime as dt
today = pd.to_datetime(dt.datetime.now().date())
days_diff = today - pd.to_datetime(customer['Recent_Date'],format= '%Y%m%d')
days_diff

0      2831 days
1      2849 days
2      2826 days
3      2825 days
4      2818 days
          ...
9995   2925 days
9996   2800 days
9997   2831 days
9998   3198 days
9999   3196 days
Name: Recent_Date, Length: 10000, dtype: timedelta64[ns]

9. Calculate percentage of sales by each last city, state and region.

In [83]:
percent= customer[['Last_region', 'Last_state', 'Last_city', 'Customer_Value']]

In [84]:
percent.head()

  Last_region   Last_state         Last_city  Customer_Value
0        West      Gujarat             Surat          2032.0
1       North        Delhi             Delhi          1709.0
2        West      Gujarat             Surat           523.0
3        West  Maharashtra  Pimpri-Chinchwad          5132.0
4       North        Delhi             Delhi          1008.0

In [85]:
percent.groupby(['Last_region'])['Customer_Value'].sum()/percent['Customer_Value'].sum()

Last_region
East     0.077987
North    0.277416
South    0.154038
West     0.490560
Name: Customer_Value, dtype: float64

In [86]:
percent.groupby(['Last_region', 'Last_state'])['Customer_Value'].sum()/percent['Customer_Value'].sum()

Last_region  Last_state
East         Assam                0.015573
             Bihar                0.002606
             Jharkhand            0.002456
             Tripura              0.000188
             West Bengal          0.057162
North        Chandigarh           0.000328
             Chhattisgarh         0.000053
             Delhi                0.085912
             Haryana              0.001415
             Jammu and Kashmir    0.000049
             Madhya Pradesh       0.053475
             Orissa               0.001566
             Punjab               0.000088
             Rajasthan            0.031332
             Uttar Pradesh        0.102959
             Uttarakhand          0.000238
South        Andhra Pradesh       0.014727
             Karnataka            0.053301
             Kerala               0.001009
             Puducherry           0.000224
             Tamil Nadu           0.046566
             Telangana            0.038211
West         Gujarat              0.375800
             Maharashtra          0.114760
Name: Customer_Value, dtype: float64

In [87]:
percent.groupby(['Last_region', 'Last_state', 'Last_city'])['Customer_Value'].sum()/percent['Customer_Value'].sum()

Last_region  Last_state   Last_city
East         Assam        Guwahati            0.015573
             Bihar        Begusarai           0.000206
                          Bhagalpur           0.000022
                          Katihar             0.000469
                          Patna               0.001851
                                                ...
West         Maharashtra  Navi Mumbai         0.000106
                          Pimpri-Chinchwad    0.033146
                          Thane               0.002372
                          Ulhasnagar          0.000057
                          Vasai-Virar         0.000860
Name: Customer_Value, Length: 116, dtype: float64

10. What is the count of customers, average number of purchases and average purchase transaction value by last state and city.

In [88]:
customer.groupby(['Last_state', 'Last_city'])['Customer_ID'].count()

Last_state      Last_city
Andhra Pradesh  Guntur               1
                Kurnool              1
                Tirupati             2
                Vijayawada          20
                Visakhapatnam      117
                                  ...
West Bengal     Kolkata            543
                North Dumdum         3
                Panihati             1
                Rajpur Sonarpur      2
                Siliguri             1
Name: Customer_ID, Length: 116, dtype: int64

In [89]:
customer.groupby(['Last_state', 'Last_city'])['Buy_Times'].count()

Last_state      Last_city
Andhra Pradesh  Guntur               1
                Kurnool              1
                Tirupati             2
                Vijayawada          20
                Visakhapatnam      117
                                  ...
West Bengal     Kolkata            543
                North Dumdum         3
                Panihati             1
                Rajpur Sonarpur      2
                Siliguri             1
Name: Buy_Times, Length: 116, dtype: int64

In [90]:
customer.groupby(['Last_state', 'Last_city'])['average_revenue_per_trip'].mean()

Last_state      Last_city
Andhra Pradesh  Guntur                0.000000
                Kurnool             778.374750
                Tirupati           1828.333333
                Vijayawada         1981.191171
                Visakhapatnam      2383.914601
                                      ...
West Bengal     Kolkata            2107.631101
                North Dumdum       3307.377778
                Panihati            989.000429
                Rajpur Sonarpur     541.500000
                Siliguri           2594.750000
Name: average_revenue_per_trip, Length: 116, dtype: float64